src/cf/Documents/уатТехнологическийПутевойЛист.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>уатТехнологическийПутевойЛист</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.уатОстаткиГСМнаТС</xr:Item>
				<xr:Item>AccumulationRegister.уатРасшифровкаРасходаГСМнаТС</xr:Item>
				<xr:Item>AccumulationRegister.уатИзносАгрегатов</xr:Item>
				<xr:Item>InformationRegister.уатСостояниеТС</xr:Item>
				<xr:Item>AccumulationRegister.уатВыработкаТС</xr:Item>
				<xr:Item>AccumulationRegister.уатРасходГСМнаТС</xr:Item>
				<xr:Item>InformationRegister.уатПланированиеРаботыТС</xr:Item>
				<xr:Item>InformationRegister.уатСчетчикиТС</xr:Item>
				<xr:Item>AccumulationRegister.уатРабочееВремяСотрудников</xr:Item>
				<xr:Item>AccumulationRegister.уатРасходы</xr:Item>
				<xr:Item>AccumulationRegister.уатВыработкаАгрегатов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Рассчитан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыезда</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВозвращения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОдометрВыезда</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОдометрВозвращения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьГСМ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеПересчитыватьРасходГСМ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПланыПримененияЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектСтроительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПробегПоGPS</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заправлено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетФактРасходаГСМ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатВидыРасчетаРасходаГСМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Температура</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УсловиеРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатУсловияРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВыработкаТС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПараметрВыработки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТС</Name>
							<Comment>Транспортное средство или оборудование</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектСтроительства</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатОбъектыСтроительства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РасходГСМ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Активен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяРаботыДвигателя</Name>
							<Comment>В часах и минутах</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяРаботыСпецоборудования</Name>
							<Comment>В часах</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выдано</Name>
							<Comment>Литров</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГСМ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстатокПриВозвращении</Name>
							<Comment>Литров</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстатокПриВыезде</Name>
							<Comment>Литров</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пробег</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасходПоGPS</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасходПоНорме</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасходПоФакту</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РасшифровкаРасходаГСМ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГСМ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНормы</Name>
							<Type>
								<v8:Type>cfg:EnumRef.уатВидыНормРасходаГСМиТЖ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасходПоНорме</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/InformationRegisters/уатМестонахождениеТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>уатМестонахождениеТС</Name>
			<Comment>(уат)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Колонна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатКолонны</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/уатНоменклатураГСМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>уатНоменклатураГСМ</Name>
			<Comment>Доп. сведения для ГСМ</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВестиУчетОстатковТЖ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГруппаГСМ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатГруппыГСМ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГСМТалона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛитровыйТалон</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НоминалТалона</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Плотность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/уатТипыСчетчиковТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатТипыСчетчиковТС</Name>
			<Comment>(уат)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Спидометр</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчетчикМЧ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/уатТехнологическийПутевойЛист/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

	
#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
	Настройки.ПриПолученииСлужебныхРеквизитов = Ложь;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// СтандартныеПодсистемы.Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	Заглушка = Истина;
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр).
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной
//                                                            параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной
//                                            параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

	Если НЕ уатОбщегоНазначенияСервер.РазрешениеПечатиНепроведенногоДокумента(МассивОбъектов) Тогда
		Возврат;
	КонецЕсли;

	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
	Возврат;
	
	уатОбщегоНазначенияСервер.УстановитьРедактированиеПечатныхФормДокумента(КоллекцияПечатныхФорм);
	
КонецПроцедуры // Печать

// Конец СтандартныеПодсистемы.Печать

// СтандартныеПодсистемы.УправлениеДоступом

// Позволяет переопределить ограничение, указанное в модуле менеджера объекта метаданных.
//
// Параметры:
//  Ограничение - Структура:
//    * Текст                             - Строка - ограничение доступа для пользователей.
//                                          Если пустая строка, значит, доступ разрешен.
//    * ТекстДляВнешнихПользователей      - Строка - ограничение доступа для внешних пользователей.
//                                          Если пустая строка, значит, доступ запрещен.
//    * ПоВладельцуБезЗаписиКлючейДоступа - Неопределено - определить автоматически.
//                                        - Булево - если Ложь, то всегда записывать ключи доступа,
//                                          если Истина, тогда не записывать ключи доступа,
//                                          а использовать ключи доступа владельца (требуется,
//                                          чтобы ограничение было строго по объекту-владельцу).
//   * ПоВладельцуБезЗаписиКлючейДоступаДляВнешнихПользователей - Неопределено, Булево - также
//                                          как у параметра ПоВладельцуБезЗаписиКлючейДоступа.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)
	|	И ЗначениеРазрешено(Подразделение)";
	
	Ограничение.ТекстДляВнешнихПользователей = Ограничение.Текст;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// СтандартныеПодсистемы.ВариантыОтчетов

// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - Таблица с командами отчетов. Для изменения.
//       См. описание 1 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	Заглушка = Истина;
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВариантыОтчетов

#КонецОбласти

#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	СформироватьТаблицаСостояниеТС(ДокументСсылка, СтруктураДополнительныеСвойства);
	СформироватьТаблицаПланированияРаботыТС(ДокументСсылка, СтруктураДополнительныеСвойства);
	Если ДокументСсылка.Рассчитан Тогда
		СформироватьТаблицаСчетчикиТС(ДокументСсылка, СтруктураДополнительныеСвойства);
		СформироватьТаблицаВыработкаТС(ДокументСсылка, СтруктураДополнительныеСвойства);
		СформироватьТаблицаГСМ(ДокументСсылка, СтруктураДополнительныеСвойства);
		СформироватьТаблицаРасходГСМ(ДокументСсылка, СтруктураДополнительныеСвойства);
		СформироватьТаблицаРасшифровкаРасходаГСМ(ДокументСсылка, СтруктураДополнительныеСвойства);
		СформироватьТаблицаИзносАгрегатов(ДокументСсылка, СтруктураДополнительныеСвойства);
		СформироватьТаблицуВыработкиАгрегатов(ДокументСсылка, СтруктураДополнительныеСвойства);
		Если уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(ДокументСсылка.Организация, "УчетРабочегоВремени") Тогда
			СформироватьТаблицаРабочееВремяРаботниковОрганизаций(ДокументСсылка, СтруктураДополнительныеСвойства);
		КонецЕсли;
		СформироватьТаблицаРасходы(ДокументСсылка, СтруктураДополнительныеСвойства);
	КонецЕсли;
КонецПроцедуры // ИнициализироватьДанныеДокумента()

Процедура ВыполнитьКонтроль(ДокументСсылка, ДополнительныеСвойства, Отказ, УдалениеПроведения = Ложь) Экспорт
	Заголовок = уатОбщегоНазначенияТиповые.уатПредставлениеДокументаПриПроведении(ДокументСсылка);
	
	Если ДокументСсылка.Рассчитан Тогда
		Для Каждого ТекСтрока Из ДокументСсылка.РасходГСМ Цикл
			Если НЕ ТекСтрока.Активен Тогда
				Продолжить;
			КонецЕсли;
			
			МоментВремени = Новый Граница(ДокументСсылка.ДатаВозвращения, ВидГраницы.Включая);
			
			ОстатокГСМ = уатОбщегоНазначения.уатОстатокГСМнаТС(МоментВремени, ТекСтрока.ТС, ТекСтрока.ГСМ, ДокументСсылка);
			Если ОстатокГСМ < 0 Тогда
				ТекстНСТР = НСтр("en='Fuels ""%1"",vehicle ""%2"" - negative remains of fuels in vehicle (%3).';ru='ГСМ ""%1"", ТС ""%2"" - отрицательный остаток ГСМ в ТС (%3).'");
				ТекстНСТР = СтрШаблон(ТекстНСТР, ТекСтрока.ГСМ, Строка(ТекСтрока.ТС), ОстатокГСМ);
				уатОбщегоНазначенияТиповые.СообщитьОбОшибке(ТекстНСТР, Отказ, Заголовок);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры 

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

#Область Проведение

// Процедура формирует таблицу рабочего времени сотрудников
// для дальнейшего формирования табеля рабочего времени
Процедура ФормированиеТаблицыРабочегоВремениДляТабеля(ТаблицаДвижений, ДокументСсылка, СтруктураДополнительныеСвойства, ВыборВодитель = Неопределено)
	мсвВодители = Новый Массив;
	Если ЗначениеЗаполнено(ДокументСсылка.Водитель) Тогда
		мсвВодители.Добавить(ДокументСсылка.Водитель);
	КонецЕсли;
		
	// добавляем Явку и Ночные
	тблРабочееВремя = уатПутевыеЛисты.РасчетВремени(ДокументСсылка.ДатаВыезда, ДокументСсылка.ДатаВозвращения, ДокументСсылка.Организация,
		Справочники.уатРежимыРаботыТС.ПустаяСсылка(), Новый ТаблицаЗначений);
	Для Каждого ТекВодитель Из мсвВодители Цикл
		Для Каждого ТекСтрокаВремя Из тблРабочееВремя Цикл
			Если ЗначениеЗаполнено(ТекСтрокаВремя.Продолжительность)
				И (ТекСтрокаВремя.ВидВремени = Справочники.уатВидыИспользованияРабочегоВремени.Явка
				ИЛИ ТекСтрокаВремя.ВидВремени = Справочники.уатВидыИспользованияРабочегоВремени.РаботаНочныеЧасы) Тогда
				
				Движение = ТаблицаДвижений.Добавить();
				Движение.Период = ДокументСсылка.ДатаВозвращения;
				Движение.ДатаРаботы = ТекСтрокаВремя.ДатаРаботы;
				Движение.Организация = ДокументСсылка.Организация;
				Движение.Сотрудник = ТекВодитель;
				Движение.ВидИспользованияРабочегоВремени = ТекСтрокаВремя.ВидВремени;
				Движение.Дней = 1;
				Движение.Время = ТекСтрокаВремя.Продолжительность;
				
				// При необходимости согласно графику работы сотрудника заменяем явку на выходной или праздник
				Если ТекСтрокаВремя.ВидВремени = Справочники.уатВидыИспользованияРабочегоВремени.Явка Тогда
					флПраздник = уатПутевыеЛисты.ПраздникПоГрафику(ТекВодитель, ДокументСсылка.Организация, ТекСтрокаВремя.ДатаРаботы);
					Если флПраздник Тогда
						Движение.ВидИспользованияРабочегоВремени = Справочники.уатВидыИспользованияРабочегоВремени.Праздники;
					Иначе
						флВыходной = уатПутевыеЛисты.ВыходнойПоГрафику(ТекВодитель, ДокументСсылка.Организация, ТекСтрокаВремя.ДатаРаботы);
						Если флВыходной Тогда
							Движение.ВидИспользованияРабочегоВремени = Справочники.уатВидыИспользованияРабочегоВремени.ВыходныеДни;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры  

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаСостояниеТС(ДокументСсылка, СтруктураДополнительныеСвойства)
	тблДвижений = Новый ТаблицаЗначений;
	тблДвижений.Колонки.Добавить("Регистратор");
	тблДвижений.Колонки.Добавить("Период");
	тблДвижений.Колонки.Добавить("ДатаОкончания");
	тблДвижений.Колонки.Добавить("ТС");
	тблДвижений.Колонки.Добавить("Состояние");
	
	НоваяСтрока = тблДвижений.Добавить();
	НоваяСтрока.ТС = ДокументСсылка.ТС;
	НоваяСтрока.Период = уатОбщегоНазначения.уатДатаБезСекунд(ДокументСсылка.ДатаВыезда);
	НоваяСтрока.ДатаОкончания = ДокументСсылка.ДатаВозвращения-1;
	НоваяСтрока.Состояние = Справочники.уатСостояниеТС.СформированПутевойЛист;
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСостоянийТС", тблДвижений);
КонецПроцедуры // СформироватьТаблицаСостояниеТС()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаПланированияРаботыТС(ДокументСсылка, СтруктураДополнительныеСвойства)
	мЗапрос = Новый Запрос;
	мЗапрос.Текст = 
	"ВЫБРАТЬ
	|	уатТехнологическийПутевойЛист.Ссылка КАК Регистратор,
	|	уатТехнологическийПутевойЛист.Ссылка КАК ДокументПланирования,
	|	уатТехнологическийПутевойЛист.ДатаВыезда КАК ДатаНачала,
	|	уатТехнологическийПутевойЛист.ДатаВозвращения КАК ДатаОкончания,
	|	ЗНАЧЕНИЕ(СПРАВОЧНИК.уатСостояниеТС.СформированПутевойЛист) КАК Состояние,
	|	уатТехнологическийПутевойЛист.ТС КАК ТС
	|ИЗ
	|	Документ.уатТехнологическийПутевойЛист КАК уатТехнологическийПутевойЛист
	|ГДЕ
	|	уатТехнологическийПутевойЛист.Ссылка = &Ссылка";
	
	мЗапрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	МассивРезультатов = мЗапрос.ВыполнитьПакет();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПланированияРаботыТС", МассивРезультатов[0].Выгрузить());
КонецПроцедуры // СформироватьТаблицаПланированияРаботыТС()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаСчетчикиТС(ДокументСсылка, СтруктураДополнительныеСвойства)
	тблДвижений = Новый ТаблицаЗначений;
	тблДвижений.Колонки.Добавить("Регистратор");
	тблДвижений.Колонки.Добавить("Период");
	тблДвижений.Колонки.Добавить("ТС");
	тблДвижений.Колонки.Добавить("ТипСчетчика");
	тблДвижений.Колонки.Добавить("Значение");
	
	Движение = тблДвижений.Добавить();
	Движение.Регистратор = ДокументСсылка;
	Движение.Период = ДокументСсылка.ДатаВозвращения-1;
	Движение.ТС = ДокументСсылка.ТС;
	Если ДокументСсылка.ТС.Модель.НаличиеСпидометра Тогда
		Движение.ТипСчетчика = Перечисления.уатТипыСчетчиковТС.Спидометр;
	Иначе
		Движение.ТипСчетчика = Перечисления.уатТипыСчетчиковТС.СчетчикМЧ;
	КонецЕсли;
	Движение.Значение = ДокументСсылка.ОдометрВозвращения;
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСчетчиковТС", тблДвижений);
КонецПроцедуры // СформироватьТаблицаСчетчикиТС()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаВыработкаТС(ДокументСсылка, СтруктураДополнительныеСвойства)
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатТехнологическийПутевойЛистВыработкаТС.Ссылка.ДатаВозвращения КАК Период,
	|	уатТехнологическийПутевойЛистВыработкаТС.ТС КАК ТС,
	|	уатТехнологическийПутевойЛистВыработкаТС.ПараметрВыработки КАК ПараметрВыработки,
	|	уатТехнологическийПутевойЛистВыработкаТС.Количество КАК Количество,
	|	уатТехнологическийПутевойЛистВыработкаТС.Подразделение КАК Подразделение,
	|	уатТехнологическийПутевойЛистВыработкаТС.Ссылка.Организация КАК Организация,
	|	уатТехнологическийПутевойЛистВыработкаТС.ОбъектСтроительства КАК ОбъектСтроительства,
	|	уатМестонахождениеТССрезПоследних.Колонна КАК Колонна
	|ИЗ
	|	Документ.уатТехнологическийПутевойЛист.ВыработкаТС КАК уатТехнологическийПутевойЛистВыработкаТС
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уатМестонахождениеТС.СрезПоследних(&ДатаВозвращения, ) КАК уатМестонахождениеТССрезПоследних
	|		ПО уатТехнологическийПутевойЛистВыработкаТС.Ссылка.ТС = уатМестонахождениеТССрезПоследних.ТС
	|ГДЕ
	|	уатТехнологическийПутевойЛистВыработкаТС.Ссылка = &Док";
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Док", ДокументСсылка);
	Запрос.УстановитьПараметр("ДатаВозвращения", ДокументСсылка.ДатаВозвращения);
	тблДвижений = Запрос.Выполнить().Выгрузить();
	
	УчетВыработкиПоПодразделениям = уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(ДокументСсылка.Организация, ПланыВидовХарактеристик.уатПраваИНастройки.УчетВыработкиПоПодразделениям);
	УчетВыработкиПоОбъектамСтроительства = уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(ДокументСсылка.Организация, ПланыВидовХарактеристик.уатПраваИНастройки.УчетВыработкиПоОбъектамСтроительства);
	Если НЕ УчетВыработкиПоПодразделениям Тогда
		тблДвижений.ЗаполнитьЗначения(Неопределено, "Подразделение");
	КонецЕсли;
	Если НЕ УчетВыработкиПоОбъектамСтроительства Тогда
		тблДвижений.ЗаполнитьЗначения(Неопределено, "ОбъектСтроительства");
	КонецЕсли;
	Если (НЕ УчетВыработкиПоПодразделениям) ИЛИ (НЕ УчетВыработкиПоОбъектамСтроительства) Тогда
		тблДвижений.Свернуть("Период, ТС, ПараметрВыработки, Подразделение, Организация, ОбъектСтроительства, Колонна", "Количество");
	КонецЕсли;
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаВыработкиТС", тблДвижений);
КонецПроцедуры // СформироватьТаблицаВыработкаТС()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаГСМ(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	Перем мТаблицаПоСписаниюГСМ;
	
	// Подготовим таблицу ГСМ для проведения.
	СтрокаОшибки = "";
	
	мЗапрос = Новый Запрос;
	мЗапрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	уатТехнологическийПутевойЛистРасходГСМ.ТС КАК ТС,
	|	уатТехнологическийПутевойЛистРасходГСМ.ГСМ КАК ГСМ
	|ИЗ
	|	Документ.уатТехнологическийПутевойЛист.РасходГСМ КАК уатТехнологическийПутевойЛистРасходГСМ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.уатНоменклатураГСМ КАК уатНоменклатураГСМ
	|		ПО уатТехнологическийПутевойЛистРасходГСМ.ГСМ = уатНоменклатураГСМ.Номенклатура
	|			И (уатНоменклатураГСМ.ГруппаГСМ В (&ГруппыГСМ))
	|ГДЕ
	|	уатТехнологическийПутевойЛистРасходГСМ.Ссылка = &Ссылка
	|	И ВЫБОР
	|			КОГДА уатНоменклатураГСМ.ГруппаГСМ <> ЗНАЧЕНИЕ(Перечисление.уатГруппыГСМ.Электроэнергия)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ уатНоменклатураГСМ.ВестиУчетОстатковТЖ
	|		КОНЕЦ";
	ГруппыГСМ = Новый Массив;
	ГруппыГСМ.Добавить(Перечисления.уатГруппыГСМ.Топливо);
	ГруппыГСМ.Добавить(Перечисления.уатГруппыГСМ.Электроэнергия);
	мЗапрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	мЗапрос.УстановитьПараметр("ГруппыГСМ", ГруппыГСМ);
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.уатОстаткиГСМнаТС");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = мЗапрос.Выполнить();
	Для каждого КолонкаРезультатЗапроса Из ЭлементБлокировки.ИсточникДанных.Колонки Цикл
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных(КолонкаРезультатЗапроса.Имя, КолонкаРезультатЗапроса.Имя);
	КонецЦикла;
	Блокировка.Заблокировать();
	
	//уатОбщегоНазначения.уатПодготовитьТаблицуСписанияГСМ(ДокументСсылка, мТаблицаПоСписаниюГСМ, Истина, , СтрокаОшибки);
	уатОбщегоНазначения_проф.уатПодготовитьТаблицуСписанияГСМ(ДокументСсылка, мТаблицаПоСписаниюГСМ, Истина, , СтрокаОшибки);
	мТаблицаПоСписаниюГСМ.Колонки.Дата.Имя = "Период";
	мТаблицаПоСписаниюГСМ.Колонки.Добавить("ВидДвижения");
	мТаблицаПоСписаниюГСМ.ЗаполнитьЗначения(ВидДвиженияНакопления.Расход, "ВидДвижения");
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаГСМ", мТаблицаПоСписаниюГСМ);
КонецПроцедуры // СформироватьТаблицаГСМ()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаРасходГСМ(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	тблДвижений = Новый ТаблицаЗначений;
	тблДвижений.Колонки.Добавить("Период");
	тблДвижений.Колонки.Добавить("ТС");
	тблДвижений.Колонки.Добавить("Водитель");
	тблДвижений.Колонки.Добавить("ГСМ");
	тблДвижений.Колонки.Добавить("Колонна");
	тблДвижений.Колонки.Добавить("Организация");
	тблДвижений.Колонки.Добавить("РасходПоНорме");
	тблДвижений.Колонки.Добавить("РасходПоФакту");
	
	мТочностьОстатковГСМ = уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(ДокументСсылка.Организация, ПланыВидовХарактеристик.уатПраваИНастройки.ТочностьОстатковТоплива);
	
	Для Каждого ТекСтрокаРасходГСМ Из ДокументСсылка.РасходГСМ Цикл
		Если (ТекСтрокаРасходГСМ.РасходПоНорме <> 0 ИЛИ
			ТекСтрокаРасходГСМ.РасходПоФакту <> 0) И ТекСтрокаРасходГСМ.Активен Тогда
			
			ТекКолоннаТС = уатОбщегоНазначения.МестонахождениеТС(ТекСтрокаРасходГСМ.ТС, ДокументСсылка.ДатаВозвращения).Колонна;
			
			мОтбор = Новый Структура("ГСМ, ТС", ТекСтрокаРасходГСМ.ГСМ, ТекСтрокаРасходГСМ.ТС);
			мНайденныеСтроки = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаГСМ.НайтиСтроки(мОтбор);
			Если мНайденныеСтроки.Количество() > 0 Тогда
				Если мНайденныеСтроки[0].Количество = ТекСтрокаРасходГСМ.РасходПоФакту Тогда
					НоваяСтрока 				= тблДвижений.Добавить();
					НоваяСтрока.Период 			= ДокументСсылка.ДатаВозвращения;
					НоваяСтрока.ТС 				= ТекСтрокаРасходГСМ.ТС;
					НоваяСтрока.Водитель 		= ДокументСсылка.Водитель;
					НоваяСтрока.ГСМ				= ТекСтрокаРасходГСМ.ГСМ;
					НоваяСтрока.Колонна = ТекКолоннаТС;
					НоваяСтрока.Организация = ДокументСсылка.Организация;
					НоваяСтрока.РасходПоНорме 	= ТекСтрокаРасходГСМ.РасходПоНорме;
					НоваяСтрока.РасходПоФакту 	= ТекСтрокаРасходГСМ.РасходПоФакту;
					
				Иначе
					мОстатокКСписаниюНорм		= ТекСтрокаРасходГСМ.РасходПоНорме;
					мАналоги					= уатОбщегоНазначения.уатПолучитьАналогиГСМ(ТекСтрокаРасходГСМ.ГСМ);
					Для Каждого ТекСтрокаТаблицыГСМ Из СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаГСМ Цикл
						Если ТекСтрокаТаблицыГСМ.ТС = ТекСтрокаРасходГСМ.ТС Тогда
							мНайденнаяСтрока_рабочая = мАналоги.Найти(ТекСтрокаТаблицыГСМ.ГСМ, "Аналог");
							Если мНайденнаяСтрока_рабочая <> Неопределено или ТекСтрокаТаблицыГСМ.ГСМ = ТекСтрокаРасходГСМ.ГСМ Тогда
								НоваяСтрока 				= тблДвижений.Добавить();
								НоваяСтрока.Период 			= ДокументСсылка.ДатаВозвращения;
								НоваяСтрока.ТС 				= ТекСтрокаРасходГСМ.ТС;
								НоваяСтрока.Водитель 		= ДокументСсылка.Водитель;
								НоваяСтрока.ГСМ				= ТекСтрокаТаблицыГСМ.ГСМ;
								НоваяСтрока.Колонна = ТекКолоннаТС;
								НоваяСтрока.Организация = ДокументСсылка.Организация;
								Если ТекСтрокаРасходГСМ.РасходПоФакту <> 0 Тогда
									мРН	= ТекСтрокаРасходГСМ.РасходПоНорме * ТекСтрокаТаблицыГСМ.Количество /ТекСтрокаРасходГСМ.РасходПоФакту;
								Иначе
									мРН	= ТекСтрокаРасходГСМ.РасходПоНорме;
								КонецЕсли;	
								НоваяСтрока.РасходПоНорме 	= мРН;
								НоваяСтрока.РасходПоФакту 	= ТекСтрокаТаблицыГСМ.Количество;
								мОстатокКСписаниюНорм		= мОстатокКСписаниюНорм - мРН; 
							КонецЕсли;						
						КонецЕсли;						
					КонецЦикла;	
					
					// последняя копейка
					Если Окр(мОстатокКСписаниюНорм, мТочностьОстатковГСМ) <> 0 Тогда
						НоваяСтрока 				= тблДвижений.Добавить();
						НоваяСтрока.Период 			= ДокументСсылка.ДатаВозвращения;
						НоваяСтрока.ТС 				= ТекСтрокаРасходГСМ.ТС;
						НоваяСтрока.Водитель 		= ДокументСсылка.Водитель;
						НоваяСтрока.ГСМ				= ТекСтрокаРасходГСМ.ГСМ;
						НоваяСтрока.Колонна = ТекКолоннаТС;
						НоваяСтрока.Организация = ДокументСсылка.Организация;
						НоваяСтрока.РасходПоНорме 	= мОстатокКСписаниюНорм;
						НоваяСтрока.РасходПоФакту 	= 0;
					КонецЕсли;	
				КонецЕсли;	
				
			Иначе
				мОстатокКСписаниюНорм		= ТекСтрокаРасходГСМ.РасходПоНорме;
				мАналоги					= уатОбщегоНазначения.уатПолучитьАналогиГСМ(ТекСтрокаРасходГСМ.ГСМ);
				Для Каждого ТекСтрокаТаблицыГСМ Из СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаГСМ Цикл
					Если ТекСтрокаТаблицыГСМ.ТС = ТекСтрокаРасходГСМ.ТС Тогда
						//МОтбор = Новый Структура("ГСМ, ТС", ТекСтрокаТаблицыГСМ.ГСМ, ТекСтрокаТаблицыГСМ.ТС);
						// мНайденныеСтроки_рабочая = мТаблицаПоСписаниюГСМ.НайтиСтроки(мОтбор);
						мНайденнаяСтрока_рабочая = мАналоги.Найти(ТекСтрокаТаблицыГСМ.ГСМ, "Аналог");
						Если мНайденнаяСтрока_рабочая <> Неопределено или ТекСтрокаТаблицыГСМ.ГСМ = ТекСтрокаРасходГСМ.ГСМ Тогда
							НоваяСтрока 				= тблДвижений.Добавить();
							НоваяСтрока.Период 			= ДокументСсылка.ДатаВозвращения;
							НоваяСтрока.ТС 				= ТекСтрокаРасходГСМ.ТС;
							НоваяСтрока.Водитель 		= ДокументСсылка.Водитель;
							НоваяСтрока.ГСМ				= ТекСтрокаТаблицыГСМ.ГСМ;
							НоваяСтрока.Колонна = ТекКолоннаТС;
							НоваяСтрока.Организация = ДокументСсылка.Организация;
							Если ТекСтрокаРасходГСМ.РасходПоФакту <> 0 Тогда
								мРН	= ТекСтрокаРасходГСМ.РасходПоНорме * ТекСтрокаТаблицыГСМ.Количество / ТекСтрокаРасходГСМ.РасходПоФакту;
							Иначе
								мРН	= ТекСтрокаРасходГСМ.РасходПоНорме;
							КонецЕсли;	
							НоваяСтрока.РасходПоНорме 	= мРН;
							НоваяСтрока.РасходПоФакту 	= ТекСтрокаТаблицыГСМ.Количество;
							мОстатокКСписаниюНорм		= мОстатокКСписаниюНорм - мРН; 
						КонецЕсли;						
					КонецЕсли;						
				КонецЦикла;	
				
				// последняя копейка
				Если Окр(мОстатокКСписаниюНорм, мТочностьОстатковГСМ) <> 0 Тогда
					НоваяСтрока 				= тблДвижений.Добавить();
					НоваяСтрока.Период 			= ДокументСсылка.ДатаВозвращения;
					НоваяСтрока.ТС 				= ТекСтрокаРасходГСМ.ТС;
					НоваяСтрока.Водитель 		= ДокументСсылка.Водитель;
					НоваяСтрока.ГСМ				= ТекСтрокаРасходГСМ.ГСМ;
					НоваяСтрока.Колонна = ТекКолоннаТС;
					НоваяСтрока.Организация = ДокументСсылка.Организация;
					НоваяСтрока.РасходПоНорме 	= мОстатокКСписаниюНорм;
					НоваяСтрока.РасходПоФакту 	= 0;
				КонецЕсли;	
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;
	
	тблДвижений.Свернуть("Период, ТС, Водитель, ГСМ, Колонна, Организация", "РасходПоНорме, РасходПоФакту");
	
	// Округляем до точности хранения остатков ГСМ в ТС
	Для Каждого ТекСтрока Из тблДвижений Цикл
		ТекСтрока.РасходПоНорме = Окр(ТекСтрока.РасходПоНорме, мТочностьОстатковГСМ);
		ТекСтрока.РасходПоФакту = Окр(ТекСтрока.РасходПоФакту, мТочностьОстатковГСМ);
	КонецЦикла;
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасходГСМ", тблДвижений);
КонецПроцедуры // СформироватьТаблицаРасходГСМ()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаРасшифровкаРасходаГСМ(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	мЗапрос = Новый Запрос;
	мЗапрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РасшифровкаРасходаГСМ.Ссылка.ДатаВозвращения КАК Период,
	|	РасшифровкаРасходаГСМ.Ссылка КАК Регистратор,
	|	РасшифровкаРасходаГСМ.Ссылка.Организация КАК Организация,
	|	РасшифровкаРасходаГСМ.ТС КАК ТС,
	|	уатМестонахождениеТС.Колонна КАК Колонна,
	|	РасшифровкаРасходаГСМ.Ссылка.Водитель КАК Водитель,
	|	РасшифровкаРасходаГСМ.ГСМ КАК ГСМ,
	|	РасшифровкаРасходаГСМ.ВидНормы КАК ВидНормы,
	|	РасшифровкаРасходаГСМ.РасходПоНорме КАК РасходПоНорме
	|ИЗ
	|	Документ.уатТехнологическийПутевойЛист.РасшифровкаРасходаГСМ КАК РасшифровкаРасходаГСМ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уатМестонахождениеТС.СрезПоследних(&ДатаСреза, ) КАК уатМестонахождениеТС
	|		ПО РасшифровкаРасходаГСМ.ТС = уатМестонахождениеТС.ТС
	|ГДЕ
	|	РасшифровкаРасходаГСМ.Ссылка = &Ссылка";
	
	мЗапрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	мЗапрос.УстановитьПараметр("ДатаСреза", ДокументСсылка.ДатаВозвращения);
	
	ТаблицаРасшифровкаРасходаГСМ = мЗапрос.Выполнить().Выгрузить();
	
	// округляем до точности хранения остатков ГСМ в ТС
	мТочностьОстатковГСМ = уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(ДокументСсылка.Организация, "ТочностьОстатковТоплива");
	Для Каждого ТекСтрока Из ТаблицаРасшифровкаРасходаГСМ Цикл
		ТекСтрока.РасходПоНорме = Окр(ТекСтрока.РасходПоНорме, мТочностьОстатковГСМ);
	КонецЦикла;
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасшифровкаРасходаГСМ", ТаблицаРасшифровкаРасходаГСМ);
КонецПроцедуры

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаИзносАгрегатов(ДокументСсылка, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Выработка.Ссылка.ДатаВозвращения КАК Период,
	|	Выработка.Ссылка.Организация КАК Организация,
	|	Выработка.ТС КАК ТС,
	|	СУММА(ВЫБОР
	|			КОГДА Выработка.ПараметрВыработки.Временный
	|				ТОГДА УстановленныеАгрегаты.СерияНоменклатуры.Модель.НормаЗатрат * УстановленныеАгрегаты.СерияНоменклатуры.ПервоначальнаяСтоимость / 100 * Выработка.Количество / 3600 / 1000
	|			ИНАЧЕ УстановленныеАгрегаты.СерияНоменклатуры.Модель.НормаЗатрат * УстановленныеАгрегаты.СерияНоменклатуры.ПервоначальнаяСтоимость / 100 * Выработка.Количество / 1000
	|		КОНЕЦ) КАК Износ,
	|	СУММА(ВЫБОР
	|			КОГДА Выработка.ПараметрВыработки.Временный
	|				ТОГДА Выработка.Количество / 3600
	|			ИНАЧЕ Выработка.Количество
	|		КОНЕЦ) КАК Пробег,
	|	СУММА(уатИзносАгрегатов.ИзносОборот) КАК ИзносНакопленный,
	|	УстановленныеАгрегаты.СерияНоменклатуры КАК СерияНоменклатуры,
	|	УстановленныеАгрегаты.СерияНоменклатуры.ПервоначальнаяСтоимость КАК ПервоначальнаяСтоимость
	|ПОМЕСТИТЬ втИзнос
	|ИЗ
	|	Документ.уатТехнологическийПутевойЛист.ВыработкаТС КАК Выработка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			уатАгрегатыТССрезПоследних.Период КАК Период,
	|			уатАгрегатыТССрезПоследних.Регистратор КАК Регистратор,
	|			уатАгрегатыТССрезПоследних.СерияНоменклатуры КАК СерияНоменклатуры,
	|			уатАгрегатыТССрезПоследних.ТС КАК ТС,
	|			уатАгрегатыТССрезПоследних.МестоУстановки КАК МестоУстановки,
	|			уатАгрегатыТССрезПоследних.СостояниеАгрегата КАК СостояниеАгрегата,
	|			уатАгрегатыТССрезПоследних.СерияНоменклатуры.Модель.ПараметрВыработкиНачисленияИзноса КАК МодельПараметрВыработкиНачисленияИзноса,
	|			уатАгрегатыТССрезПоследних.СерияНоменклатуры.Модель.ПараметрВыработкиНачисленияИзноса КАК МодельНормаЗатрат
	|		ИЗ
	|			РегистрСведений.уатАгрегатыТС.СрезПоследних(&Дата, СерияНоменклатуры.Модель.ВариантНачисленияИзноса = ЗНАЧЕНИЕ(Перечисление.уатВариантыНачисленияИзносаАгрегатов.Выработка)) КАК уатАгрегатыТССрезПоследних
	|		ГДЕ
	|			уатАгрегатыТССрезПоследних.СостояниеАгрегата В(&СостояниеАгрегата)
	|			И уатАгрегатыТССрезПоследних.ТС В(&ВСоставе)) КАК УстановленныеАгрегаты
	|		ПО Выработка.ТС = УстановленныеАгрегаты.ТС
	|			И Выработка.ПараметрВыработки = УстановленныеАгрегаты.СерияНоменклатуры.Модель.ПараметрВыработкиНачисленияИзноса
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.уатИзносАгрегатов.Обороты(, &Дата, ) КАК уатИзносАгрегатов
	|		ПО (УстановленныеАгрегаты.СерияНоменклатуры = уатИзносАгрегатов.СерияНоменклатуры)
	|ГДЕ
	|	Выработка.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Выработка.Ссылка.ДатаВозвращения,
	|	Выработка.Ссылка.Организация,
	|	Выработка.ТС,
	|	УстановленныеАгрегаты.СерияНоменклатуры,
	|	УстановленныеАгрегаты.СерияНоменклатуры.ПервоначальнаяСтоимость
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втИзнос.Период КАК Период,
	|	втИзнос.Организация КАК Организация,
	|	втИзнос.ТС КАК ТС,
	|	втИзнос.СерияНоменклатуры КАК СерияНоменклатуры,
	|	втИзнос.Пробег КАК Пробег,
	|	ВЫБОР
	|		КОГДА втИзнос.Износ > втИзнос.ПервоначальнаяСтоимость - втИзнос.ИзносНакопленный
	|			ТОГДА втИзнос.ПервоначальнаяСтоимость - втИзнос.ИзносНакопленный
	|		ИНАЧЕ втИзнос.Износ
	|	КОНЕЦ КАК Износ
	|ИЗ
	|	втИзнос КАК втИзнос
	|ГДЕ
	|	ВЫБОР
	|		КОГДА втИзнос.Износ > втИзнос.ПервоначальнаяСтоимость - втИзнос.ИзносНакопленный
	|			ТОГДА втИзнос.ПервоначальнаяСтоимость - втИзнос.ИзносНакопленный
	|		ИНАЧЕ втИзнос.Износ
	|	КОНЕЦ > 0 ИЛИ втИзнос.Пробег > 0");
	Запрос.УстановитьПараметр("Дата", Новый Граница(ДокументСсылка.ДатаВозвращения, ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("ВСоставе", ДокументСсылка.ВыработкаТС.ВыгрузитьКолонку("ТС"));
	СписокСостоянийАгрегата = Новый СписокЗначений;
	СписокСостоянийАгрегата.Добавить(Перечисления.уатСостоянияАгрегатов.УстановленоВРаботе);
	СписокСостоянийАгрегата.Добавить(Перечисления.уатСостоянияАгрегатов.УстановленоНеисправно);
	Если уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(ДокументСсылка.Организация, ПланыВидовХарактеристик.уатПраваИНастройки.НачислятьИзносНаЗапаску) Тогда
		СписокСостоянийАгрегата.Добавить(Перечисления.уатСостоянияАгрегатов.УстановленоВЗапас);
	КонецЕсли;
	Запрос.УстановитьПараметр("СостояниеАгрегата", СписокСостоянийАгрегата);
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	мТаблицаИзносАгрегатов = Запрос.Выполнить().Выгрузить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаИзносаАгрегатов", мТаблицаИзносАгрегатов);
	
КонецПроцедуры // СформироватьТаблицаИзносАгрегатов()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицуВыработкиАгрегатов(ДокументСсылка, СтруктураДополнительныеСвойства)
	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатАгрегатыТССрезПоследних.СерияНоменклатуры КАК СерияНоменклатуры,
	|	уатАгрегатыТССрезПоследних.ТС КАК ТС,
	|	уатАгрегатыТССрезПоследних.СерияНоменклатуры.ПараметрВыработки КАК ПараметрВыработки
	|ПОМЕСТИТЬ Временная
	|ИЗ
	|	РегистрСведений.уатАгрегатыТС.СрезПоследних(&Дата, ТС В (&ТС)) КАК уатАгрегатыТССрезПоследних
	|ГДЕ
	|	уатАгрегатыТССрезПоследних.СостояниеАгрегата = ЗНАЧЕНИЕ(Перечисление.уатСостоянияАгрегатов.УстановленоВРаботе)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	уатПутевойЛистВыработкаТС.Ссылка.ДатаВозвращения КАК Период,
	|	уатПутевойЛистВыработкаТС.Ссылка.Организация КАК Организация,
	|	уатПутевойЛистВыработкаТС.ТС КАК ТС,
	|	Временная.СерияНоменклатуры КАК СерийныйНомер,
	|	уатПутевойЛистВыработкаТС.ПараметрВыработки КАК ПараметрВыработки,
	|	СУММА(уатПутевойЛистВыработкаТС.Количество) КАК Количество
	|ИЗ
	|	Временная КАК Временная
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уатТехнологическийПутевойЛист.ВыработкаТС КАК уатПутевойЛистВыработкаТС
	|		ПО уатПутевойЛистВыработкаТС.ПараметрВыработки = Временная.ПараметрВыработки
	|			И уатПутевойЛистВыработкаТС.ТС = Временная.ТС
	|ГДЕ
	|	уатПутевойЛистВыработкаТС.Ссылка = &Ссылка
	|	И уатПутевойЛистВыработкаТС.ПараметрВыработки В
	|			(ВЫБРАТЬ
	|				Временная.ПараметрВыработки
	|			ИЗ
	|				Временная)
	|
	|СГРУППИРОВАТЬ ПО
	|	уатПутевойЛистВыработкаТС.Ссылка.ДатаВозвращения,
	|	уатПутевойЛистВыработкаТС.Ссылка.Организация,
	|	уатПутевойЛистВыработкаТС.ТС,
	|	Временная.СерияНоменклатуры,
	|	уатПутевойЛистВыработкаТС.ПараметрВыработки";
	Запрос.УстановитьПараметр("Дата", Новый Граница(ДокументСсылка.ДатаВозвращения, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ТС", ДокументСсылка.ВыработкаТС.ВыгрузитьКолонку("ТС"));
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	мТаблицаВыработкиАгрегатов = Запрос.Выполнить().Выгрузить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПараметровВыработкиАгрегатов", мТаблицаВыработкиАгрегатов);
КонецПроцедуры 

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаРабочееВремяРаботниковОрганизаций(ДокументСсылка, СтруктураДополнительныеСвойства)
	Если Не уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(ДокументСсылка.Организация, ПланыВидовХарактеристик.уатПраваИНастройки.УчетРабочегоВремени) Тогда
		Возврат;
	КонецЕсли;
	
	мТаблица = Новый ТаблицаЗначений;
	мТаблица.Колонки.Добавить("Период");
	мТаблица.Колонки.Добавить("Сотрудник");
	мТаблица.Колонки.Добавить("Организация");
	мТаблица.Колонки.Добавить("ВидИспользованияРабочегоВремени");
	мТаблица.Колонки.Добавить("ДатаРаботы");
	мТаблица.Колонки.Добавить("Дней");
	мТаблица.Колонки.Добавить("Время");
	
	ФормированиеТаблицыРабочегоВремениДляТабеля(мТаблица, ДокументСсылка, СтруктураДополнительныеСвойства);
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРабочегоВремени", мТаблица);
КонецПроцедуры // СформироватьТаблицаРабочееВремяРаботниковОрганизаций()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаРасходы(ДокументСсылка, СтруктураДополнительныеСвойства)
	
	Если ПолучитьФункциональнуюОпцию("уатИспользоватьУчетДоходовИРасходов") = ЛОЖЬ Тогда
		Возврат;
	КонецЕсли;
	
	СтатьяРасходовГСМ = Неопределено;
	СтатьяРасходовШины = Неопределено;
	СтатьяРасходовЗП = Неопределено;
	Для Каждого ТекСтрока Из ДокументСсылка.ПланЗатрат.Расходы Цикл
		Если СтатьяРасходовГСМ = Неопределено И ТекСтрока.СтатьяРасходов.ВидЗатрат = Перечисления.уатВидыЗатрат.ГСМ Тогда
			СтатьяРасходовГСМ = ТекСтрока.СтатьяРасходов;
		ИначеЕсли СтатьяРасходовШины = Неопределено И ТекСтрока.СтатьяРасходов.ВидЗатрат = Перечисления.уатВидыЗатрат.Шины Тогда
			СтатьяРасходовШины = ТекСтрока.СтатьяРасходов;
		ИначеЕсли СтатьяРасходовЗП = Неопределено И ТекСтрока.СтатьяРасходов.ВидЗатрат = Перечисления.уатВидыЗатрат.ОплатаТруда Тогда
			СтатьяРасходовЗП = ТекСтрока.СтатьяРасходов;
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаРасходы = Новый ТаблицаЗначений;
	ТаблицаРасходы.Колонки.Добавить("СтатьяРасходов", Новый ОписаниеТипов("СправочникСсылка.уатСтатьиРасходов"));
	ТаблицаРасходы.Колонки.Добавить("СчетРасходов",   Новый ОписаниеТипов("ПланСчетовСсылка.уатРегламентированный"));
	ТаблицаРасходы.Колонки.Добавить("ТС",             Новый ОписаниеТипов("СправочникСсылка.уатТС"));
	ТаблицаРасходы.Колонки.Добавить("СуммаРегл",      Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(15, 2)));
	ТаблицаРасходы.Колонки.Добавить("СуммаУпр",       Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(15, 2)));
	ТаблицаРасходы.Колонки.Добавить("СуммаНДС",       Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(15, 2)));
	ТаблицаРасходы.Колонки.Добавить("СуммаНДСУпр",    Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(15, 2)));
	
	Если ЗначениеЗаполнено(СтатьяРасходовГСМ) Тогда
		Для Каждого ТекСтрока Из СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаГСМ Цикл
			ТекСуммаНДСУпр = ?(ТекСтрока.Стоимость = 0, 0, ТекСтрока.СуммаНДС * ТекСтрока.СтоимостьУпр / ТекСтрока.Стоимость);
			
			НоваяСтрокаВрем                = ТаблицаРасходы.Добавить();
			НоваяСтрокаВрем.СтатьяРасходов = СтатьяРасходовГСМ;
			НоваяСтрокаВрем.СчетРасходов   = СтатьяРасходовГСМ.Счет;
			НоваяСтрокаВрем.ТС             = ТекСтрока.ТС;
			НоваяСтрокаВрем.СуммаРегл      = ТекСтрока.Стоимость + ТекСтрока.СуммаНДС;
			НоваяСтрокаВрем.СуммаУпр       = ТекСтрока.СтоимостьУпр + ТекСуммаНДСУпр;
			НоваяСтрокаВрем.СуммаНДС       = ТекСтрока.СуммаНДС;
			НоваяСтрокаВрем.СуммаНДСУпр    = ТекСуммаНДСУпр;
		КонецЦикла;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтатьяРасходовШины) Тогда
		Для Каждого ТекСтрока Из СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаИзносаАгрегатов Цикл
			НоваяСтрокаВрем = ТаблицаРасходы.Добавить();
			НоваяСтрокаВрем.СтатьяРасходов = СтатьяРасходовШины;
			НоваяСтрокаВрем.СчетРасходов = СтатьяРасходовШины.Счет;
			НоваяСтрокаВрем.ТС = ТекСтрока.ТС;
			НоваяСтрокаВрем.СуммаРегл = ТекСтрока.Износ;
			НоваяСтрокаВрем.СуммаУпр = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(НоваяСтрокаВрем.СуммаРегл,
				СтруктураДополнительныеСвойства.ВалютаРеглУчета, СтруктураДополнительныеСвойства.ВалютаУпрУчета,
				ДокументСсылка.ДатаВозвращения, ДокументСсылка.ДатаВозвращения,,,,
				ДокументСсылка);
		КонецЦикла;
	КонецЕсли;
	
	ТаблицаРасходы.Свернуть("СтатьяРасходов, СчетРасходов, ТС", "СуммаУпр, СуммаРегл, СуммаНДС, СуммаНДСУпр");
	
	ТекстОшибок = "";
	уатПроведение.РаспределитьЗатратыМеждуАналитиками(ДокументСсылка, ТаблицаРасходы, ТекстОшибок);
	
	ТаблицаРасходы.Колонки.Добавить("Период");
	ТаблицаРасходы.ЗаполнитьЗначения(ДокументСсылка.ДатаВозвращения, "Период");
	ТаблицаРасходы.Колонки.Добавить("Регистратор");
	ТаблицаРасходы.ЗаполнитьЗначения(ДокументСсылка, "Регистратор");
	ТаблицаРасходы.Колонки.Добавить("Организация");
	ТаблицаРасходы.ЗаполнитьЗначения(ДокументСсылка.Организация, "Организация");
	ТаблицаРасходы.ЗаполнитьЗначения(ДокументСсылка.Подразделение, "Подразделение");
	ТаблицаРасходы.ЗаполнитьЗначения(ДокументСсылка.ОбъектСтроительства, "ОбъектСтроительства");
		
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасходы", ТаблицаРасходы);
КонецПроцедуры // СформироватьТаблицаРасходы()

#КонецОбласти

#КонецОбласти


#КонецЕсли
